%插值分析
% 求在x = 0.35的值
x0 = 0.35;
x = [0.32 0.34 0.36 0.38];
y = [0.314567 0.333487 0.352274 0.370920];
% 标准答案
disp('标准答案：');
standard = interp1(x,y,x0,'linear');
disp(standard);

% 线性插值
disp('线性插值：');
x1 = [0.34 0.36];
y1 = [0.333487 0.352274];
result1 = Lagrange(x1, y1, x0);
disp(result1);

% 二次插值
disp('二次插值：');
x2 = [0.32 0.34 0.36];
y2 = [0.314567 0.333487 0.352274];
result2 = Lagrange(x2, y2, x0);
disp(result2);

% 三次插值
disp('三次插值：');
x3 = [0.32 0.34 0.36 0.38];
y3 = [0.314567 0.333487 0.352274 0.370920];
result3 = Lagrange(x3, y3, x0);
disp(result3);